def choice():
    return input('''Выберите цифру из вариантов что хотите сделать:
    1 - Посмотреть телефонную книгу.
    2 - Добавить контакт в телефонную книгу.
    3 - Изменить данные в телефонной книге.
    4 - Поиск.
    Ваш выбор: ''')

def choice_re():
    return input('''Выберите цифру из вариантов что хотите сделать:
    1 - Изменить фамилию.
    2 - Изменить имя.
    3 - Изменить номер телефона.
    4 - Изменить описание.
    5 - Удалить контакт, полностью.
    Ваш выбор: ''')


     